In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn import tree
from sklearn.model_selection import train_test_split

In [2]:
train_data=pd.read_csv('train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#Target -> Survived -> 0=No, 1=Yes
#Remove Unwanted columns suchas Pid, Name, SibSp,Parch,Ticket,Cabin, Embarked
#i.e. Input Variables= Pclass, Sex,Age, Fare

In [3]:
inputs=train_data[['Pclass','Sex','Age','Fare']]

In [4]:
inputs.describe()

           Pclass         Age        Fare
count  891.000000  714.000000  891.000000
mean     2.308642   29.699118   32.204208
std      0.836071   14.526497   49.693429
min      1.000000    0.420000    0.000000
25%      2.000000   20.125000    7.910400
50%      3.000000   28.000000   14.454200
75%      3.000000   38.000000   31.000000
max      3.000000   80.000000  512.329200

In [5]:
target=train_data['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
inputs.isnull()

     Pclass    Sex    Age   Fare
0     False  False  False  False
1     False  False  False  False
2     False  False  False  False
3     False  False  False  False
4     False  False  False  False
..      ...    ...    ...    ...
886   False  False  False  False
887   False  False  False  False
888   False  False   True  False
889   False  False  False  False
890   False  False  False  False

[891 rows x 4 columns]

In [7]:
#Age Contains Null Values
inputs.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [8]:
meanAge=inputs.Age.mean()
meanAge

29.69911764705882

In [9]:
meanAge=round(meanAge)
meanAge

30

In [10]:
inputs['Age']=inputs.Age.fillna(meanAge)

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_1596/3008833782.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['Age']=inputs.Age.fillna(meanAge)

In [11]:
inputs.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [12]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

# Label Encode The Sex Column

In [13]:
Sex_le=LabelEncoder()

In [14]:
Sex_le

LabelEncoder()

In [15]:
inputs['Sex_le']=Sex_le.fit_transform(inputs['Sex'])

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_1596/1090927673.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['Sex_le']=Sex_le.fit_transform(inputs['Sex'])

In [16]:
inputs.head()

   Pclass     Sex   Age     Fare  Sex_le
0       3    male  22.0   7.2500       1
1       1  female  38.0  71.2833       0
2       3  female  26.0   7.9250       0
3       1  female  35.0  53.1000       0
4       3    male  35.0   8.0500       1

In [17]:
inputs.drop(['Sex'],axis='columns',inplace=True)

C:\Users\ADMIN\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [18]:
inputs.head()

   Pclass   Age     Fare  Sex_le
0       3  22.0   7.2500       1
1       1  38.0  71.2833       0
2       3  26.0   7.9250       0
3       1  35.0  53.1000       0
4       3  35.0   8.0500       1

# Splitting into Training and Testing Set

In [28]:
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.1)

In [30]:
len(x_train)

801

In [29]:
len(y_train)

801


# Decision Tree : Model Training

In [31]:
model=tree.DecisionTreeClassifier()

In [32]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [33]:
model.score(x_train,y_train)

0.9762796504369539

In [34]:
model.score(x_test,y_test)

0.8555555555555555

# Predictions

In [35]:
x_train.head()

     Pclass   Age      Fare  Sex_le
334       1  30.0  133.6500       0
878       3  30.0    7.8958       1
237       2   8.0   26.2500       0
112       3  22.0    8.0500       1
704       3  26.0    7.8542       1

In [36]:
model.predict([[3,22,7.2,1]]) #PClass=3, Age=22, Fare=7.2, Sex=1->Male

array([1], dtype=int64)

In [37]:
model.predict([[2,14,30.07,0]])

array([1], dtype=int64)

# Predictions On Test Set Available

In [38]:
test_set=pd.read_csv('test.csv')
Prediction_test_inputs=test_set[['Pclass','Sex','Age','Fare']]

In [39]:
len(Prediction_test_inputs)

418

In [41]:
Prediction_test_inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [42]:
Prediction_test_inputs['Sex_le']=Sex_le.fit_transform(Prediction_test_inputs['Sex'])

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_1596/3876617215.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Prediction_test_inputs['Sex_le']=Sex_le.fit_transform(Prediction_test_inputs['Sex'])

In [43]:
Prediction_test_inputs.drop(['Sex'],axis='columns',inplace=True)
Prediction_test_inputs.head()

C:\Users\ADMIN\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

   Pclass   Age     Fare  Sex_le
0       3  34.5   7.8292       1
1       3  47.0   7.0000       0
2       2  62.0   9.6875       1
3       3  27.0   8.6625       1
4       3  22.0  12.2875       0

In [44]:
x_train.head()

     Pclass   Age      Fare  Sex_le
334       1  30.0  133.6500       0
878       3  30.0    7.8958       1
237       2   8.0   26.2500       0
112       3  22.0    8.0500       1
704       3  26.0    7.8542       1

In [47]:
round(Prediction_test_inputs['Age'].mean())

30

In [48]:
Prediction_test_inputs_Age_Mean=round(Prediction_test_inputs['Age'].mean())

In [51]:
Prediction_test_inputs['Age']=Prediction_test_inputs.Age.fillna(Prediction_test_inputs_Age_Mean)

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_1596/2206855182.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Prediction_test_inputs['Age']=Prediction_test_inputs.Age.fillna(Prediction_test_inputs_Age_Mean)

In [60]:
Prediction_test_inputs.notnull()

     Pclass   Age  Fare  Sex_le
0      True  True  True    True
1      True  True  True    True
2      True  True  True    True
3      True  True  True    True
4      True  True  True    True
..      ...   ...   ...     ...
413    True  True  True    True
414    True  True  True    True
415    True  True  True    True
416    True  True  True    True
417    True  True  True    True

[418 rows x 4 columns]

In [53]:
Prediction_test_inputs['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    30.0
414    39.0
415    38.5
416    30.0
417    30.0
Name: Age, Length: 418, dtype: float64

In [54]:
Prediction_test_inputs

     Pclass   Age      Fare  Sex_le
0         3  34.5    7.8292       1
1         3  47.0    7.0000       0
2         2  62.0    9.6875       1
3         3  27.0    8.6625       1
4         3  22.0   12.2875       0
..      ...   ...       ...     ...
413       3  30.0    8.0500       1
414       1  39.0  108.9000       0
415       3  38.5    7.2500       1
416       3  30.0    8.0500       1
417       3  30.0   22.3583       1

[418 rows x 4 columns]

In [61]:
model.predict(x_test)

array([1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1], dtype=int64)

In [67]:
Prediction_test_inputs['Age'][30:]

30     50.0
31     24.0
32     33.0
33     30.0
34     30.0
       ...
413    30.0
414    39.0
415    38.5
416    30.0
417    30.0
Name: Age, Length: 388, dtype: float64

In [68]:
#Fare column has also null value

In [73]:
Prediction_test_inputs_Fare_Median=Prediction_test_inputs['Age'].median()
Prediction_test_inputs_Fare_Median

30.0

In [74]:
Prediction_test_inputs['Fare']=Prediction_test_inputs['Fare'].fillna(Prediction_test_inputs_Fare_Median)

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_1596/2739273941.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Prediction_test_inputs['Fare']=Prediction_test_inputs['Fare'].fillna(Prediction_test_inputs_Fare_Median)

In [77]:
Predicted_test_target=model.predict(Prediction_test_inputs)
Predicted_test_target

array([0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [80]:
Actual_test_target=pd.read_csv('gender_submission.csv')
Actual_test_target

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [81]:
Actual_test_target=Actual_test_target['Survived']

In [82]:
model.score(Prediction_test_inputs,Actual_test_target) #x_test,y_test

0.8014354066985646

#### Variables 
    #### From Training Set : -> x_train,y_train,x_test,y_test
    #### From Test Set -> Prediction_test_inputs,Actual_test_target

# Random Forest : Training

In [83]:
from sklearn.ensemble import RandomForestClassifier
RFC=RandomForestClassifier() #by default n_estimators=10 -> Number of decision trees
RFC

RandomForestClassifier()

In [84]:
RFC.fit(x_train,y_train)

RandomForestClassifier()

In [102]:
RFC.score(x_train,y_train)

0.9762796504369539

In [85]:
RFC.score(x_test,y_test)

0.9

In [86]:
RFC.score(Prediction_test_inputs,Actual_test_target)

0.861244019138756

### Increasing Number Of Decision Trees

In [ ]:
#20

In [98]:
RFC2=RandomForestClassifier(n_estimators=20)
RFC2.fit(x_train,y_train)
RFC2.score(x_test,y_test)

0.8888888888888888

In [99]:
RFC2.score(Prediction_test_inputs,Actual_test_target)

0.8444976076555024

In [ ]:
#30

In [100]:
RFC3=RandomForestClassifier(n_estimators=30)
RFC3.fit(x_train,y_train)
RFC3.score(x_test,y_test)

0.9111111111111111

In [103]:
RFC3.score(x_train,y_train)

0.9737827715355806

In [101]:
RFC3.score(Prediction_test_inputs,Actual_test_target)

0.8492822966507177

    # Seems that model works pretty fine on the default number of estimators i.e 10